# По объекту Мурино_Стелс
# Стена 1
square_1_1 = 2.64 * 56.62 + 2.59 * 4.02  # Площадь для утеплителя
square_2_1 = 2.29 * 4.02 + 2.34 * (56.62 + 1.3 + 2.75 + 4.2 + 1.9)  # Площадь для штукатурки
square_3_1 = 2.64 * 56.62 + 2.59 * 4.02  # Площадь для грунтовки
#print(square_1_1, square_2_1)
# Стена 2
square_1_2 = 334.1 + 27.34 + 11.55 - 1.995 - 0.22 - 0.313 * 17 - 0.49 + 1.21  # Площадь для утеплителя
square_2_2 = 334.1 + 27.34 + 11.55 - 1.995 - 0.22 - 0.313 * 17 - 0.49  # Площадь для штукатурки
square_3_2 = 2.64 * 56.62 + 2.59 * 4.02  # Площадь для грунтовки (для стены 2 не посчитано)
#print(square_1_2, square_2_2)